# Economic Development and Environmental Pollution

In [22]:
# Importing relevant libraries

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [5]:
# Read relevant data

df_pop = pd.read_csv('population_total.csv')
df_forest_area = pd.read_csv('forest_area_sq_km.csv')
df_co2_emissions = pd.read_csv('co2_emissions_tonnes_per_person.csv')
df_gdp = pd.read_csv('total_gdp_ppp_inflation_adjusted.csv')

In [33]:
def display_all(df):
    with pd.option_context('display.max_rows',1000):
        with pd.option_context('display.max_columns',1000):
            display(df)

In [58]:
#df_use= df_pop.loc[:, '1990':'2020']
df_country = df_pop.loc[:, 'country':'country']
type(df_country)

pandas.core.frame.DataFrame

In [52]:
df_pop.country

0               Afghanistan
1                    Angola
2                   Albania
3                   Andorra
4      United Arab Emirates
               ...
192                   Samoa
193                   Yemen
194            South Africa
195                  Zambia
196                Zimbabwe
Name: country, Length: 197, dtype: object

In [59]:
y = df_pop[['country']]
type(y)

pandas.core.frame.DataFrame

In [60]:
y

                  country
0             Afghanistan
1                  Angola
2                 Albania
3                 Andorra
4    United Arab Emirates
..                    ...
192                 Samoa
193                 Yemen
194          South Africa
195                Zambia
196              Zimbabwe

[197 rows x 1 columns]

In [47]:
df_use.describe()

,1990,1991,1992,1993,1994,1995,1996,1997,1998,1999,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
count,197,197,197,197,197,197,197,197,197,197,...,197,197,197,197,197,197,197,197,197,197
unique,188,188,187,190,188,184,187,181,185,177,...,190,189,186,187,184,187,183,190,186,188
top,10.2M,13.3M,10.4M,619k,30.4k,3.22M,22.1M,10.2M,11M,8.05M,...,4.08M,10.5M,2.06M,109k,10.7M,110k,4.06M,1.27M,11.5M,2.08M
freq,3,2,3,2,2,3,2,3,3,4,...,2,2,2,3,3,2,2,2,3,2

In [30]:
df_forest_area.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 32 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   country  214 non-null    object
 1   1990     210 non-null    object
 2   1991     210 non-null    object
 3   1992     210 non-null    object
 4   1993     210 non-null    object
 5   1994     210 non-null    object
 6   1995     210 non-null    object
 7   1996     210 non-null    object
 8   1997     210 non-null    object
 9   1998     210 non-null    object
 10  1999     210 non-null    object
 11  2000     214 non-null    object
 12  2001     210 non-null    object
 13  2002     210 non-null    object
 14  2003     210 non-null    object
 15  2004     210 non-null    object
 16  2005     210 non-null    object
 17  2006     210 non-null    object
 18  2007     210 non-null    object
 19  2008     210 non-null    object
 20  2009     210 non-null    object
 21  2010     214 non-null    object
 22  2011     214 non-null    object
 23  2012     214 non-null    object
 24  2013     214 non-null    object
 25  2014     214 non-null    object
 26  2015     214 non-null    object
 27  2016     214 non-null    object
 28  2017     214 non-null    object
 29  2018     214 non-null    object
 30  2019     210 non-null    object
 31  2020     210 non-null    object
dtypes: object(32)
memory usage: 53.6+ KB

In [31]:
df_co2_emissions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 194 entries, 0 to 193
Columns: 220 entries, country to 2018
dtypes: float64(215), object(5)
memory usage: 333.6+ KB

In [32]:
df_gdp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 229 entries, 0 to 228
Columns: 215 entries, country to 2013
dtypes: object(215)
memory usage: 384.8+ KB